1 ''' 
2 [문제7] 모스 부호 해독 
3 문자열 형식으로 입력받은 모스 부호(dot: . dash:-)를 해독하여 영어 문장으로 출력하는 프로그램을 작성해 보자. 
4  
5 글자와 글자 사이는 공백 하나, 단어와 단어 사이는 공백 두개로 구분한다. 
6 예를 들어 다음 모스부호는 "HE SLEEPS EARLY"로 해석해야 한다. 
7  
8 .... .  ... .-.. . . .--. ...  . .- .-. .-.. -.-- 
9 모스부호 규칙 표 
10  
11 문자	부호	문자	부호 
12 A	.-	N	-. 
13 B	-...	O	--- 
14 C	-.-.	P	.--. 
15 D	-..	Q	--.- 
16 E	.	R	.-. 
17 F	..-.	S	... 
18 G	--.	T	- 
19 H	....	U	..- 
20 I	..	V	...- 
21 J	.---	W	.-- 
22 K	-.-	X	-..- 
23 L	.-..	Y	-.-- 
24 M	--	Z	--.. 
25 '''
